learning-ws/src/main/resources/Availability/GetRoomDetail/GetRoomDetailRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <KwsSoapHeader xmlns="http://www.shijinet.com.cn/kunlun/kws/1.1/">
      <SessionId>string</SessionId>
      <RetCode>string</RetCode>
      <ErrReason>string</ErrReason>
    </KwsSoapHeader>
  </soap:Header>
  <soap:Body>
    <GetRoomDetail xmlns="http://www.shijinet.com.cn/kunlun/kws/1.1/">
      <hotel_code>string</hotel_code>
      <roomtype_code>string</roomtype_code>
    </GetRoomDetail>
  </soap:Body>
</soap:Envelope>